In [1]:
'/Users/jared/.pyenv/versions/3.11.0/bin/python -m pip install ipykernel -U --force-reinstall'

'/Users/jared/.pyenv/versions/3.11.0/bin/python -m pip install ipykernel -U --force-reinstall'

In [4]:
pip install pandas

Requirement already satisfied: pandas in /Users/jared/.pyenv/versions/3.11.0/lib/python3.11/site-packages (2.0.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/jared/.pyenv/versions/3.11.0/lib/python3.11/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Users/jared/.pyenv/versions/3.11.0/lib/python3.11/site-packages (from pandas) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in /Users/jared/.pyenv/versions/3.11.0/lib/python3.11/site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in /Users/jared/.pyenv/versions/3.11.0/lib/python3.11/site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in /Users/jared/.pyenv/versions/3.11.0/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip available: 22.3 -> 23.1.2
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [5]:
import pandas as pd

In [6]:
import numpy as np

In [7]:
dummy_dataframe = pd.DataFrame({'col1':[1,2,3,4], 'col2':[8,7,9,6]})

In [8]:
dummy_dataframe

   col1  col2
0     1     8
1     2     7
2     3     9
3     4     6

In [9]:
dummy_series = pd.Series([1,7,8,9,6])

In [10]:
type(dummy_dataframe)

pandas.core.frame.DataFrame

In [11]:
type(dummy_dataframe['col1'])

pandas.core.series.Series

In [12]:
new_list = dummy_dataframe['col1'].to_list()

In [13]:
new_list.extend([5,4,7,8])

In [14]:
updated_dataframe = pd.concat([pd.Series(new_list),dummy_dataframe['col2']], axis=1)

In [15]:
updated_dataframe.columns = ['col1','col2']

In [16]:
updated_dataframe

   col1  col2
0     1   8.0
1     2   7.0
2     3   9.0
3     4   6.0
4     5   NaN
5     4   NaN
6     7   NaN
7     8   NaN

In [17]:
dummy_dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
dtypes: int64(2)
memory usage: 192.0 bytes

In [18]:
updated_dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    8 non-null      int64
 1   col2    4 non-null      float64
dtypes: float64(1), int64(1)
memory usage: 256.0 bytes

In [20]:
dummy_dataframe.index

RangeIndex(start=0, stop=4, step=1)

In [22]:
dummy_dataframe.columns

Index(['col1', 'col2'], dtype='object')

In [23]:
dummy_dataframe.axes

[RangeIndex(start=0, stop=4, step=1), Index(['col1', 'col2'], dtype='object')]

In [24]:
dummy_dataframe.head()

   col1  col2
0     1     8
1     2     7
2     3     9
3     4     6

In [25]:
dummy_dataframe.tail()

   col1  col2
0     1     8
1     2     7
2     3     9
3     4     6

In [26]:
dummy_dataframe.describe()

           col1      col2
count  4.000000  4.000000
mean   2.500000  7.500000
std    1.290994  1.290994
min    1.000000  6.000000
25%    1.750000  6.750000
50%    2.500000  7.500000
75%    3.250000  8.250000
max    4.000000  9.000000

In [27]:
#isolating a specific column
dummy_dataframe.col1

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [28]:
dummy_dataframe['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [34]:
#iloc/loc function helps to isolate the row
#iloc = index location value of the index
#loc = location of the actual value
dummy_dataframe.iloc[2].loc['col1']

3

In [30]:
dummy_dataframe

   col1  col2
0     1     8
1     2     7
2     3     9
3     4     6

In [36]:
dummy_dataframe.index = ['val1','val2','val3','val4']

In [37]:
dummy_dataframe

      col1  col2
val1     1     8
val2     2     7
val3     3     9
val4     4     6

In [41]:
dummy_dataframe.iloc[0].loc['col2']

8

In [40]:
dummy_dataframe.loc['val1']

col1    1
col2    8
Name: val1, dtype: int64

In [42]:
dummy_dataframe.iloc[1,1]

7

In [44]:
dummy_dataframe.iloc[0:2,1] #slicing a range of rows , and the column in position 1 (second position) #slicing gives u row and column name separated by "," so A,B is row A and column B

val1    8
val2    7
Name: col2, dtype: int64

In [45]:
dummy_dataframe.loc[['val1','val3'],['col1','col2']] #slicing selected rows/columns - we need to pass a list of conditions, thus 2 sets of brackets

      col1  col2
val1     1     8
val3     3     9

In [46]:
dummy_dataframe.iloc[[0,2],[0,1]] #same as above, but this is slicing based on position

      col1  col2
val1     1     8
val3     3     9